Tutoriels/interIsoFoam/obstaclePoreux/system/probes
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"
  
fields (p U);
probeLocations
(
    (0.01 0 0)
);

